{
  "main": {
    "test": "test text oder so...",
    "nav_back": "Zurück",
    "nav_howto": "How To Smerge",
    "nav_impressum": "Impressum"
  },
  "SettingsModal": {
    "old_title": "Projekt Einstellungen",
    "graph_title": "Graph Einstellungen"
  },
  "OldSettingControls": {
    "project_pin": "Projekt Pin:",
    "change_password": "Kennwort ändern:",
    "old_password": "Altes Passwort",
    "new_password": "Neues Passwort",
    "change": "Ändern",
    "change_project_name": "Projektnamen ändern:",
    "change_project_desc": "Projektbeschreibung ändern:",
    "language": "Sprache:",
    "delete_project": "Projekt löschen"
  },
  "NewSettingControls": {
    "save_graph_pos": "Graphposition speichern",
    "save_current_layout": "Aktuelles Layout speichern (in Datei)",
    "load_layout": "Layout aus Datei laden",
    "layout": "Layout",
    "old_projectview": "Alte Projektansicht",
    "breadthfirst": "Breite zuerst",
    "concentric": "Konzentrisch",
    "dagre": "Dagre",
    "preset": "Servergespeichert",
    "circle": "Kreis",
    "cose": "Kraft (Cose)",
    "grid": "Gitter",
    "random": "Zufällig",
    "save_graph_pos_tooltip": "Aktuelles Layout auf dem Server speichern (als \"Servergespeichert\" Layout)",
    "save_current_layout_tooltip": "Laden Sie den aktuellen Graph in einer JSON-Datei herunter",
    "load_layout_tooltip": "Laden Sie das zuvor gespeicherte Diagramm (.json) in das aktuelle Panel (klicken Sie auf \"Graphposition speichern\", wenn Sie möchten, dass das geladene Diagramm als Serverlayout gespeichert wird).",
    "scroll_speed": "Zoomgeschwindigkeit ändern:",
    "color_style": "Projektfarben ändern:",
    "unhide_all": "Alles Einblenden / Aufklappen",
    "unhide_popover": {
      "text": "Sind Sie sicher, dass alle Knoten eingeblendet / expandiert werden sollen?",
      "button": "Ja",
      "button_cancel": "Nein"
    }
  },
  "HelpPages": {
    "page0": {
      "header": "Generelle Benutzungshinweise",
      "item0": {
        "header": "Navigation",
        "footer": "**__Allgemeine Navigation:\n -Linke Maustaste auf einem Knoten drücken und ziehen, um diesen zu bewegen\n  -Die Positionen der einzelnen Knoten werden ausschließlich im Modus \"Servergespeichert\" gespeichert und geteilt\n -Außerhalb eines Knotens die linke Maustaste drücken und ziehen, um den Graph zu bewegen\n -Mit Mausrad kann ran- und rausgezoomt werden"
      },
      "item1": {
        "header": "Elemente auswählen",
        "footer": "**__Knoten auswählen:\n -Shift oder Strg Taste halten und auf die Knoten klicken, um diese auszuwählen \n  -Ausgewählte Knoten werden rosa markiert\n -Shift Taste halten und die Maus bewegen, um einen Auswahlrahmen zu erzeugen"
      },
      "item2": {
        "header": "Kontextmenü",
        "footer": "**__Drücken der rechten Maustaste auf einem Knoten öffnet das Kontextmenü\n - Herunterladen: Die entsprechende Snap!-Datei herunterladen.\n - Als Favorit markieren: Einen Knoten für alle sichtbar markieren.\n - Bearbeiten: Die Bezeichnung eines Knotens bearbeiten.\n - Kollabieren: Alle darunterliegenden Knoten unter dem ausgewählten kollabieren."
      }
    },
    "page1": {
      "header": "Snap!-Integration",
      "item0": {
        "header": "Snap! öffnen",
        "footer": "Doppelklick auf einen Knoten öffnet diesen in Snap!"
      },
      "item1": {
        "header": "JavaScript aktivieren und Daten importieren",
        "footer": "**__JavaScript aktivieren:\n -Um Smerge nutzen zu können, müssen JavaScript extensions in Snap! aktiviert werden.\n  -Die Einstellungen öffnen und ein Häkchen bei \"JavaScript extensions\" setzen.\n -Mit einem Klick auf den \"Activate JS and Import Data\" Baustein können die eigenen Daten importiert werden."
      },
      "item2": {
        "header": "Fortschritt an Smerge senden",
        "footer": "**__Post to Smerge:\n -Mit einem Klick auf den \"Post to Smerge\" Baustein im Tab \"Variables\" werden nach der Eingabe einer kurzen Beschreibung der neuen Version die Änderungen in Smerge hochgeladen."
      }
    },
    "page2": {
      "item0": {
        "header": "Knoten mergen",
        "footer": "**__Zwei Knoten mergen:\n -Zwei Knoten können ausgewählt und mit einem Klick auf den \"New Smerge\" Button im rechten unteren Eck nach Bestätigung verbunden (gemerged) werden. "
      },
      "item1": {
        "header": "Mergekonflikte",
        "footer": "**__Lösen von Mergekonflikten:\n -Wenn zwei Projektversionen nicht miteinander kompatibel sind, entsteht ein Mergekonflikt. Mergekonflikte müssen manuell aufgelöst werden. \n  -Ein Doppelklick auf einen Mergekonflikt öffnet eine Übersicht der konfliktierenden Elemente. \n  -Um fortzufahren, muss eine Auswahl zwischen der linken oder der rechten Version des Projekts getroffen werden."
      },
      "item2": {
        "header": "Die alte Smerge Version benutzen",
        "footer": "Um zum alten Smerge Merger zu wechseln, mit der rechten Maustaste auf die Schaltfläche \"Neue Zusammenführung\" in der unteren rechten Ecke klicken."
      }
    },
    "page3": {
      "header": "Einstellungen",
      "item1": {
        "header": "Grapheinstellungen",
        "footer": "**__Grapheinstellungsoptionen:\n -Graphposition speichern: speichert das aktuelle Layout und aktualisiert es für alle Benutzer (bei Verwendung der Option \"Servergespeichertes Layout\").\n -Layout: ändert das Graphlayout. Optionen beinhalten:\n  -Dagre: traditionelles hierarchisches Layout; Standardoption. \n  -Servergespeichert: die benutzerdefinierte Option die auf dem Server gespeichert wurde. \n  -Zufällig: platziert die Knoten nach dem Zufallsprinzip.\n  -Gitter: zeigt alle Knoten im Diagramm in einem Gitter an.\n  -Kreis: ordnet die Knoten in einem Kreis an.\n  -Konzentrisch: ordnet die Knoten in konzentrischen Kreisen an.\n  -Breite zuerst: ordnet die Knoten in Ebenen an, entsprechend den Ebenen, die durch eine Breitensuche im Graphen erzeugt werden.\n  -Kraft (Kose): sortiert die Knoten nach einer Implementierung des CoSE-Algorithmus.\n -Zoomgeschwindigkeit ändern: aktualisiert die Zoomgeschwindigkeit.\n -Projektfarben ändern: Ermöglicht die Aktualisierung des Farbschemas für normale Knoten, als Favoriten markierte Knoten und Knoten mit Mergekonflikten.\n -Alte Projektansicht: schaltet auf die alte Smerge-Projekt-Einstellungsansicht um."
      },
      "item2": {
        "header": "Layouts speichern und laden",
        "footer": "Beim Drücken auf \"Aktuelles Layout speichern\" wird das aktuelle Layout als JSON-Datei auf das System des Benutzers heruntergeladen. Die Datei kann durch Klicken auf die Schaltfläche \"Layout aus Datei laden\" geladen werden, wodurch das in der Datei beschriebene Layout wiederhergestellt werden kann."
      },
      "item0": {
        "footer": "**__Projekteinstellungsoptionen:\n -Kennwort ändern: aktualisiert das Kennwort oder setzt ein Kennwort, wenn zuvor keines gesetzt war (erfordert eine Passworteingabe)\n -Projektname ändern: aktualisiert den Projektnamen (erfordert eine Passworteingabe)\n -Projektbeschreibung ändern: aktualisiert die Projektbeschreibung (erfordert eine Passworteingabe)\n -Projekt löschen: löscht das Projekt (erfordert eine Passworteingabe und eine Bestätigung; Achtung: die Löschung ist endgültig!)\n -Sprache: ermöglicht die Auswahl der Appsprache",
        "header": "Projekt Einstellungen"
      }
    }
  }
}
